Prajwal-Mangaluru/EAA1-Electronic_GasPedal/Lab1_GasPedal/Lab1_GasPedal.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "ErikaOS_1_ee.h"
#include "ErikaOS_1_ee_tracing.h"
#include "JOYSTICK_ADC.h"
#include "JOYSTICK_X_aliases.h"
#include "JOYSTICK_X.h"
#include "JOYSTICK_Y_aliases.h"
#include "JOYSTICK_Y.h"
#include "Engine_PWM.h"
#include "Engine_LED_aliases.h"
#include "Engine_LED.h"
#include "Brake_LED_aliases.h"
#include "Brake_LED.h"
#include "UART_LOG.h"
#include "WD_Button_aliases.h"
#include "WD_Button.h"
#include "isr_WD_Button.h"
#include "Engine_Clock.h"
#include "JOYSTICK_ADC_SAR.h"
#include "JOYSTICK_ADC_IntClock.h"
#include "JOYSTICK_ADC_TempBuf_dma.h"
#include "JOYSTICK_ADC_FinalBuf_dma.h"
#include "JOYSTICK_ADC_IRQ.h"
#include "UART_LOG_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

